Функция ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза, План) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновнойЗапрос.ПрайсЛист КАК ПрайсЛист
		|ИЗ
		|	(ВЫБРАТЬ
		|		Регистр.План КАК План,
		|		МАКСИМУМ(Регистр.Период) КАК Период
		|	ИЗ
		|		РегистрСведений.ИсторияИзмененийОсновныхПрайсЛистов КАК Регистр
		|	ГДЕ
		|		Регистр.Период <= &ДатаСреза
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Регистр.План) КАК ПоследниеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияИзмененийОсновныхПрайсЛистов КАК ОсновнойЗапрос
		|		ПО (ОсновнойЗапрос.План = ПоследниеДанные.План)
		|			И (ОсновнойЗапрос.Период = ПоследниеДанные.Период)
		|ГДЕ
		|	ОсновнойЗапрос.План = &План";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("План", План);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
		Возврат Неопределено;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество() = 1 Тогда 
		ВыборкаДетальныеЗаписи.Следующий();	
		Возврат ВыборкаДетальныеЗаписи.ПрайсЛист;
	Иначе
		ВызватьИсключение "Ошибка регистра, не может быть несколько записей на заданную дату!";
	КонецЕсли;
		
КонецФункции