
Процедура УдалитьКонфигурацию(СерверСсылка, ИмяКонфигурации) Экспорт
	
	НаборЗаписей = РегистрыСведений.КонфигурацииСервера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.СлотыКонфигураций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ЗарезервиватьСлот(КонтрагентСсылка, РегионСсылка=Неопределено) Экспорт
	
	ОптимальнаяКонфигурация = ВыбратьОптимальнуюКонфигурацию(РегионСсылка);
	
	Если ОптимальнаяКонфигурация = Неопределено Тогда
		ВызватьИсключение "Не удалось подобрать конфигурацию для резервации слота";	
	КонецЕсли;
	
	ВыборкаРегистра = РегистрыСведений.СлотыКонфигураций.Выбрать(,,Новый Структура(
		"Сервер,ИмяКонфигурации,Статус",
		ОптимальнаяКонфигурация.Сервер, ОптимальнаяКонфигурация.ИмяКонфигурации, Перечисления.СтатусСлотаКонфигурации.Свободен
	));
	
	// TODO тут!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!1
	//Возврат Новый Структура(
	//	"ИмяФайла,Файл", 
	//    ЗаполнитьНазваниеФайлаСлучайныймиЦифрами(ОптимальнаяКонфигурация.РегионСервера.ИдентификаторДляФайла),
	//	ДанныеСлота.data.file
	//);
	
КонецФункции

Функция ПодключитьКонфигурацию(ИмяКонфигурации, СерверСсылка, ЛимитСлотов) Экспорт
	
	СтатусКонфигурации = WGD_Соединение.ПолучитьДанныеКонфигурации(ИмяКонфигурации, СерверСсылка, Истина);
	
	Если СтатусКонфигурации = Перечисления.СтатусКонфигурации.Ок ИЛИ
			СтатусКонфигурации = Перечисления.СтатусКонфигурации.Выключена Тогда		
			
		Попытка
			ДанныеГенерации = WGD_Соединение.ГенерироватьСлотыКонфигурации(ИмяКонфигурации, СерверСсылка, ЛимитСлотов);
		Исключение
			Возврат Перечисления.СтатусКонфигурации.ОшибкаЗапроса;	
		КонецПопытки;
		
		Если НЕ ДанныеГенерации.status Тогда
			Возврат Перечисления.СтатусКонфигурации.ОшибкаЗапроса;	
		КонецЕсли;
		
		ДанныеСлотов = WGD_Соединение.ПолучитьВсеСлотыКонфигурации(СерверСсылка, ИмяКонфигурации);
		Если Не ДанныеСлотов.status Тогда
			Возврат Перечисления.СтатусКонфигурации.ОшибкаЗапроса;				
		КонецЕсли;
		
		РегистрыСведений.СлотыКонфигураций.ДобавитьСлотыИзОтветаСервера(ДанныеСлотов.data, ДанныеГенерации.data, СерверСсылка, ИмяКонфигурации);
		РегистрыСведений.КонфигурацииСервера.ДобавитьНовуюКонфигурацию(СерверСсылка, ИмяКонфигурации, ЛимитСлотов);
		
	КонецЕсли;
	
	Возврат СтатусКонфигурации;
	
КонецФункции

Функция ВыбратьОптимальнуюКонфигурацию(РегионСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сервер.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СЕРВЕРА_ВТ
		|ИЗ
		|	Справочник.Сервер КАК Сервер
		|ГДЕ
		|	(&РегионСсылка = ЗНАЧЕНИЕ(Справочник.ГеографическийРегион.ПустаяСсылка)
		|			ИЛИ Сервер.РегионСервера = &РегионСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоЗанято,
		|	СлотыКонфигураций.Сервер КАК Сервер,
		|	СлотыКонфигураций.ИмяКонфигурации КАК ИмяКонфигурации
		|ПОМЕСТИТЬ ЗАНЯТО_СЛОТОВ_ВТ
		|ИЗ
		|	СЕРВЕРА_ВТ КАК СЕРВЕРА_ВТ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
		|		ПО (СлотыКонфигураций.Сервер = СЕРВЕРА_ВТ.Ссылка)
		|ГДЕ
		|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Используется)
		|	И СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
		|
		|СГРУППИРОВАТЬ ПО
		|	СлотыКонфигураций.Сервер,
		|	СлотыКонфигураций.ИмяКонфигурации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗАНЯТО_СЛОТОВ_ВТ.Сервер КАК Сервер,
		|	ЗАНЯТО_СЛОТОВ_ВТ.ИмяКонфигурации КАК ИмяКонфигурации,
		|	ВЫБОР
		|		КОГДА ЗАНЯТО_СЛОТОВ_ВТ.КоличествоЗанято = 0
		|				ИЛИ ЗАНЯТО_СЛОТОВ_ВТ.Сервер.МаксимумСлотов = 0
		|			ТОГДА 0
		|		ИНАЧЕ ЗАНЯТО_СЛОТОВ_ВТ.КоличествоЗанято / ЗАНЯТО_СЛОТОВ_ВТ.Сервер.МаксимумСлотов
		|	КОНЕЦ КАК КоэфициентЗанятости,
		|	ЗАНЯТО_СЛОТОВ_ВТ.Сервер.РегионСервера КАК РегионСервера
		|ИЗ
		|	ЗАНЯТО_СЛОТОВ_ВТ КАК ЗАНЯТО_СЛОТОВ_ВТ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонфигурацииСервера КАК КонфигурацииСервера
		|		ПО (КонфигурацииСервера.Сервер = ЗАНЯТО_СЛОТОВ_ВТ.Сервер)
		|			И (КонфигурацииСервера.ИмяКонфигурации = ЗАНЯТО_СЛОТОВ_ВТ.ИмяКонфигурации)
		|ГДЕ
		|	ЗАНЯТО_СЛОТОВ_ВТ.КоличествоЗанято < КонфигурацииСервера.МаксимумСлотов
		|
		|УПОРЯДОЧИТЬ ПО
		|	КоэфициентЗанятости";
	
	Запрос.УстановитьПараметр("РегионСсылка", РегионСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтатусыСерверов = Новый Соответствие;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтатусСервера = СтатусыСерверов.Получить(ВыборкаДетальныеЗаписи.Сервер);
		
		Если СтатусСервера = Неопределено Тогда
			Попытка
				СтатусСервера_Массив = WGD_Соединение.ПолучитьСтатусыКонфигурацийСервера(ВыборкаДетальныеЗаписи.Сервер);			
			Исключение
				Продолжить;	
			КонецПопытки;
			СтатусСервера = ОбщегоНазначения.ПреобразованиеМассивВТаблицуЗначений(СтатусСервера_Массив.data);
			СтатусыСерверов.Вставить(ВыборкаДетальныеЗаписи.Сервер, СтатусСервера);
		КонецЕсли;
		
		ДанныеКонфигурации = СтатусСервера.Найти(ВыборкаДетальныеЗаписи.ИмяКонфигурации, "Name");
		
		Если ДанныеКонфигурации.status Тогда
			Возврат Новый Структура("ИмяКонфигурации,Сервер,РегионСервера",
				ВыборкаДетальныеЗаписи.ИмяКонфигурации, ВыборкаДетальныеЗаписи.Сервер, ВыборкаДетальныеЗаписи.РегионСервера
			);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
		
КонецФункции

Функция ЗаполнитьНазваниеФайлаСлучайныймиЦифрами(ИдентификаторДляФайла)
	
	Возврат ИдентификаторДляФайла + "_" + ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр(4, Истина);
	
КонецФункции

