
Процедура УдалитьКонфигурацию(СерверСсылка, ИмяКонфигурации) Экспорт
	
	НаборЗаписей = РегистрыСведений.КонфигурацииСервера.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.СлотыКонфигураций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	НаборЗаписей.Отбор.ИмяКонфигурации.Установить(ИмяКонфигурации);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция СоздатьСлот(КонтрагентСсылка, РегионСсылка=Неопределено)
	
	СерверСсылка = ВыбратьОптимальныйСерверИКонфигурацию(РегионСсылка);
	
КонецФункции

Функция ВыбратьОптимальныйСерверИКонфигурацию(РегионСсылка)
	
	
	// TODO ТУТ ПРОДОЛЖИТЬ
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Сервер.Ссылка КАК Ссылка
	//	|ПОМЕСТИТЬ СЕРВЕРА_ВТ
	//	|ИЗ
	//	|	Справочник.Сервер КАК Сервер
	//	|ГДЕ
	//	|	(&РегионСсылка = НЕОПРЕДЕЛЕНО
	//	|			ИЛИ Сервер.РегионСервера = &РегионСсылка)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(1) КАК КоличествоЗанято,
	//	|	СлотыКонфигураций.Сервер КАК Сервер,
	//	|	СлотыКонфигураций.ИмяКонфигурации КАК ИмяКонфигурации
	//	|ПОМЕСТИТЬ ЗАНЯТО_СЛОТОВ_ВТ
	//	|ИЗ
	//	|	СЕРВЕРА_ВТ КАК СЕРВЕРА_ВТ
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
	//	|		ПО (СлотыКонфигураций.Сервер = СЕРВЕРА_ВТ.Ссылка)
	//	|ГДЕ
	//	|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	СлотыКонфигураций.Сервер,
	//	|	СлотыКонфигураций.ИмяКонфигурации";
	
		//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонфигурацииСервера КАК КонфигурацииСервера
		//|			ПО (КонфигурацииСервера.Сервер = СлотыКонфигураций.Сервер
		//|				И КонфигурацииСервера.ИмяКонфигурации = СлотыКонфигураций.ИмяКонфигурации)
КонецФункции