
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Подписка") Тогда
		// Заполнение шапки
		ДатаФормирования = ТекущаяДата();
		КрайнийСрокОплаты = ДатаФормирования + ОбщегоНазначения.НеделиВСекунды(1);
		Контрагент = ДанныеЗаполнения.Клиент;
		Подписка = ДанныеЗаполнения.Ссылка;
		БазоваяСтоимость = ДанныеЗаполнения.БазоваяСтоимость;
		СуммаДокумента = ДанныеЗаполнения.СуммаРегулярногоПлатежа;
		Тариф = ДанныеЗаполнения.Тариф;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
