
HELLO_TEXT = """
Здесь вы найдете все необходимое для обеспечения вашей свободы и безопасности в интернете. Мы предлагаем:

⚡ <b>Скорость и стабильность:</b> Наслаждайтесь высоким качеством интернета без тормозов

🛡️ <b>Полная конфиденциальность:</b> Ваши данные под надежной защитой от посторонних глаз

🌏 <b>Неограниченный доступ к контенту:</b> Открывайте мир интернета без ограничений

📞 <b>Техническая поддержка:</b> Наша команда всегда готова помочь и ответить на ваши вопросы

Мы ценим ваше доверие и стремимся сделать ваше пребывание в сети удобным и безопасным.
Если у вас возникнут вопросы или потребуется помощь, просто дайте нам знать! 👉 /help

👇 Тарифы VPN
"""
