Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтавкиПартнеров
	Движения.СтавкиПартнеров.Записывать = Истина;
	Для Каждого ТекСтрокаПартнеры Из Партнеры Цикл
		Движение = Движения.СтавкиПартнеров.Добавить();
		Движение.Период = Дата;
		Движение.Партнер = ТекСтрокаПартнеры.Партнер;
		Движение.Компания = Ссылка;
		Движение.Ставка = ТекСтрокаПартнеры.Ставка;
	КонецЦикла;

	// регистр ПромокодыПериодДействия
	Движения.ПромокодыПериодДействия.Записывать = Истина;
	Для Каждого ТекСтрокаПартнеры Из Партнеры Цикл
		Движение = Движения.ПромокодыПериодДействия.Добавить();
		Движение.Промокод = ТекСтрокаПартнеры.Промокод;
		Движение.ПрайсЛист = ПрайсЛист;
		Движение.Реферал = ТекСтрокаПартнеры.Партнер;
		Движение.НачалоДействия = ТекСтрокаПартнеры.НачалоУчастия;
	   	Если ЗначениеЗаполнено(ТекСтрокаПартнеры.КонецУчастия) Тогда
			Движение.КонецДействия = ТекСтрокаПартнеры.КонецУчастия;
		Иначе
			Движение.КонецДействия = ОбщегоНазначения.ДатаОкончанияВремен();
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
