#Область ФункцииДляБром
Функция ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза=Неопределено, План=Неопределено) Экспорт
	
	Если ДатаСреза = Неопределено Тогда
		
		ДатаСреза = ТекущаяДата();	
		
	КонецЕсли;
	
	Если План = Неопределено Тогда
		
		План = Перечисления.ПланПодписки.Базовый;	
		
	КонецЕсли;
	
	
	ПрайсЛист = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза, План);
	
	Если ПрайсЛист = Неопределено Тогда
		
		Возврат ОтветСервера(404);	
		
		
	Иначе
		
		Возврат ОтветСервера(200, ПрайсЛист);
		
	КонецЕсли;
	
КонецФункции


Функция НачатьНовуюСессиюКлиента(ТелеграмИД, БотСтрока) Экспорт
		
	СейчасДата = ТекущаяДата();
	
	НовыйКонтрагент = Справочники.Контрагент.СоздатьЭлемент();
	НовыйКонтрагент.Родитель = ПредопределенноеЗначение("Справочник.Контрагент.Клиенты");
	НовыйКонтрагент.Наименование = СтрШаблон("Клиент %1", ТелеграмИД);
	НовыйКонтрагент.Записать();
	
	НоваяСессия = РегистрыСведений.ТекущиеСессииТелеграм.СоздатьМенеджерЗаписи();
	НоваяСессия.ТелеграмИД = ТелеграмИД;
	НоваяСессия.Бот = Перечисления.Бот.ПолучитьЗначениеПоСтроке(БотСтрока);
	НоваяСессия.НачалоСессии = СейчасДата;
	НоваяСессия.ПоследнееИспользование = СейчасДата;
	
	Возврат НовыйКонтрагент;
	
КонецФункции

Функция ПолучитьКонтрагентаСессии(ТелеграмИД, БотСтрока) Экспорт
	
	Бот = Перечисления.Бот.ПолучитьЗначениеПоСтроке(БотСтрока);
	
	Если Бот = Неопределено ИЛИ ТипЗнч(ТелеграмИД) <> Тип("Число") Тогда
		
		Возврат ОтветСервера(400);	
		
	КонецЕсли;
	
	Контрагент = РегистрыСведений.ТекущиеСессииТелеграм.ПолучитьКонтрагентаСессии(ТелеграмИД, Бот);
	
	Если Контрагент <> Неопределено Тогда
		
		Возврат ОтветСервера(200, Контрагент);
		
	Иначе
		
		Контрагент = НачатьНовуюСессиюКлиента(ТелеграмИД, БотСтрока);
		Возврат ОтветСервера(200, Контрагент);	
		
	КонецЕсли;
	
КонецФункции
	
#КонецОбласти

#Область Вспомогательное
	
#КонецОбласти

#Область Служебное

Функция ОтветСервера(КодОтвета, Результат=Неопределено)
		
	Возврат Новый Структура("status,result", Строка(КодОтвета), Результат);
	
КонецФункции
	
#КонецОбласти