#Область ФункцииДляБром

Функция ТестСоединения() Экспорт
	
	Возврат ОтветСервера(200, Истина);
	
КонецФункции

Функция ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза=Неопределено, ПланПодписки=Неопределено) Экспорт
	
	Если ДатаСреза = Неопределено Тогда
		
		ДатаСреза = ТекущаяДата();	
		
	КонецЕсли;
	
	Если ПланПодписки = Неопределено Тогда
		
		ПланПодписки = Перечисления.ПланПодписки.Базовый;	
		
	КонецЕсли;
	
	
	ПрайсЛист = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза, ПланПодписки);
	
	Если ПрайсЛист = Неопределено Тогда
		
		Возврат ОтветСервера(404);	
		
		
	Иначе
		
		Возврат ОтветСервера(200, ПрайсЛист);
		
	КонецЕсли;
	
КонецФункции

Функция СоздатьСессиюЕслиНовая(ТелеграмИД, БотСтрока="market") Экспорт
	
	Бот = Перечисления.Бот.ПолучитьЗначениеПоСтроке(БотСтрока);
	
	Если Бот = Неопределено ИЛИ ТипЗнч(ТелеграмИД) <> Тип("Число") Тогда
		
		Возврат ОтветСервера(400);	
		
	КонецЕсли;
	
	РегистрыСведений.ТекущиеСессииТелеграм.ПолучитьКонтрагентаСессииИлиСоздать(ТелеграмИД, Бот);
		
	Возврат ОтветСервера(200);
	
КонецФункции

Функция ПолучитьДанныеПоПромокоду(Промокод, ПланПодписки=Неопределено, ДатаПодписки=Неопределено) Экспорт
	
	Если ДатаПодписки = Неопределено Тогда
		
		ДатаПодписки = ТекущаяДата();	
		
	КонецЕсли;
	
	Если ПланПодписки = Неопределено Тогда
		
		ПланПодписки = Перечисления.ПланПодписки.Базовый;	
		
	КонецЕсли;

	
	ДанныеПромокода = ПромокодыНаСервере.ПолучитьДанныеПоПромокоду(Промокод, ПланПодписки, ДатаПодписки);
	
	Если ДанныеПромокода = Неопределено Тогда
		
		Возврат ОтветСервера(404);
		
	Иначе
		
		Возврат ОтветСервера(200, ДанныеПромокода);
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область Служебное

Функция ОтветСервера(КодОтвета, Результат=Неопределено)
		
	Возврат Новый Структура("status,result", Строка(КодОтвета), Результат);
	
КонецФункции
	
#КонецОбласти