 
 #Область УсловныеОператоры
 
Функция ДатаЗаполнена(Знач ДатаЗначение) Экспорт

	Если ДатаЗначение = Дата(1, 1, 1) Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
 	
 #КонецОбласти
 
#Область УниверсальныеОбъекты

Функция СоответствиеВСтруктуру(СоответствиеЗнач) Экспорт
	
	Результат = Новый Структура;
	
	Если ТипЗнч(СоответствиеЗнач) = Тип("Соответствие") Тогда
		
		Фиксированная = Ложь;
		
	ИначеЕсли ТипЗнч(СоответствиеЗнач) = Тип("ФиксированноеСоответствие") Тогда
		
		Фиксированная = Истина;
		
	Иначе
		
		ВызватьИсключение "Неверный тип значения";
		
	КонецЕсли;
	
	Для Каждого Элемент Из СоответствиеЗнач Цикл
		
		Результат.Вставить(Элемент.Ключ, Элемент.Значение);	
		
	КонецЦикла;
	
	Если Фиксированная Тогда
		
		Возврат Новый ФиксированнаяСтруктура(Результат);
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции
	
#КонецОбласти

#Область ОбъектыМетаданных

Функция ПолучитьУИД(Объект) Экспорт
	
	Возврат Строка(Объект.УникальныйИдентификатор());	
	
КонецФункции

Функция ПолучитьОбъектИзУИД(ТипОбъекта, ИмяОбъекта, УИД) Экспорт
		
	Если ТипОбъекта = "Справочник" Тогда
		МетаОбъект = Справочники[ИмяОбъекта];   	
	ИначеЕсли ТипОбъекта = "Документ" Тогда	
		МетаОбъект = Документы[ИмяОбъекта];
	Иначе
		ВызватьИсключение "Неизвестный тип объекта";
	КонецЕсли;
	
	Возврат МетаОбъект.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));

КонецФункции

#КонецОбласти

#Область JSON

Функция ОбъектВJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);			
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JSONВСтруктуру(JSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции
	
#КонецОбласти

#Область ДатаВремя

Функция МинутыВСекунды(Минуты) Экспорт
	
	Возврат Минуты * 60;	
	
КонецФункции   

Функция ЧасыВСекунды(Часы) Экспорт
	
	Возврат Часы * 3600;	
	
КонецФункции

Функция ДниВСекунды(Дни) Экспорт
	
	Возврат Дни * 86400;	
	
КонецФункции 

Функция НеделиВСекунды(Недели) Экспорт
	
	Возврат Недели * 604800;	
	
КонецФункции
	
#КонецОбласти

#Область ГлобальныеКонстанты

Функция ДатаОкончанияВремен() Экспорт
	
	Возврат Дата(3999, 12, 31, 23, 59, 59);	
	
КонецФункции
	
#КонецОбласти