 
 #Область УсловныеОператоры
 
Функция ДатаЗаполнена(Знач ДатаЗначение) Экспорт

	Если ДатаЗначение = Дата(1, 1, 1) Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
 	
 #КонецОбласти
 
#Область УниверсальныеОбъекты

Функция СоответствиеВСтруктуру(СоответствиеЗнач) Экспорт
	
	Результат = Новый Структура;
	
	Если ТипЗнч(СоответствиеЗнач) = Тип("Соответствие") Тогда
		
		Фиксированная = Ложь;
		
	ИначеЕсли ТипЗнч(СоответствиеЗнач) = Тип("ФиксированноеСоответствие") Тогда
		
		Фиксированная = Истина;
		
	Иначе
		
		ВызватьИсключение "Неверный тип значения";
		
	КонецЕсли;
	
	Для Каждого Элемент Из СоответствиеЗнач Цикл
		
		Результат.Вставить(Элемент.Ключ, Элемент.Значение);	
		
	КонецЦикла;
	
	Если Фиксированная Тогда
		
		Возврат Новый ФиксированнаяСтруктура(Результат);
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт

   Массив = Новый Массив();
   СтруктураСтрокой = "";
   НужнаЗапятая = Ложь;
   
   Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
	   
	   Если НужнаЗапятая Тогда
           СтруктураСтрокой = СтруктураСтрокой + ",";
	   КонецЕсли;
	   
       СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
       НужнаЗапятая = Истина;
	   
   КонецЦикла;
   
   Для Каждого Строка Из ТаблицаЗначений Цикл
	   
       НоваяСтрока = Новый Структура(СтруктураСтрокой);
       ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
       Массив.Добавить(НоваяСтрока);
	   
   КонецЦикла;
   
   Возврат Массив;

КонецФункции

Функция ПреобразованиеМассивВТаблицуЗначений(Массив) Экспорт

   ТЗ = Новый ТаблицаЗначений;

   Для Каждого СтрокаМассива Из Массив Цикл

       Если ТЗ.Колонки.Количество() = 0 Тогда
           Для Каждого ЭлементМассива Из СтрокаМассива Цикл
               ТЗ.Колонки.Добавить(ЭлементМассива.Ключ);
           КонецЦикла;
       КонецЕсли;

       НоваяСтрока = ТЗ.Добавить();
       Для Каждого ЭлементМассива Из СтрокаМассива Цикл
           НоваяСтрока[ЭлементМассива.Ключ] = ЭлементМассива.Значение;
       КонецЦикла;

   КонецЦикла;

   Возврат ТЗ;

КонецФункции

#КонецОбласти

#Область JSON

Функция ОбъектВJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);			
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции
	
#КонецОбласти

#Область ДатаВремя

Функция МинутыВСекунды(Минуты) Экспорт
	
	Возврат Минуты * 60;	
	
КонецФункции   

Функция ЧасыВСекунды(Часы) Экспорт
	
	Возврат Часы * 3600;	
	
КонецФункции

Функция ДниВСекунды(Дни) Экспорт
	
	Возврат Дни * 86400;	
	
КонецФункции 

Функция НеделиВСекунды(Недели) Экспорт
	
	Возврат Недели * 604800;	
	
КонецФункции

Функция ДнейВМесяце(ДатаВремя) Экспорт
	
	Возврат День(КонецМесяца(ДатаВремя));	
	
КонецФункции

#КонецОбласти

#Область ГлобальныеКонстанты

Функция ДатаОкончанияВремен() Экспорт
	
	Возврат Дата(3999, 12, 31, 23, 59, 59);	
	
КонецФункции
	
#КонецОбласти

#Область Генераторы

Функция ГенерироватьСлучайнуюПоследовательностьБуквЦифр(Длина=8, РазныйРегистр=Ложь) Экспорт
	
	Результат = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ВариантыСимволов = "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"; // 36 символов
	
	Для К = 1 По Длина Цикл
				
		РандЧ = ГСЧ.СлучайноеЧисло(1, 36);
		СлучайныйСимвол = Сред(ВариантыСимволов, РандЧ, 1);
		
		Если РазныйРегистр Тогда
			Если ГСЧ.СлучайноеЧисло(0, 1) = 1 Тогда
				СлучайныйСимвол	= НРег(СлучайныйСимвол);
			КонецЕсли;
		КонецЕсли;
		
		Результат = Результат + СлучайныйСимвол;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ИсполнениеПрограмногоКода

Процедура Спать(Время) Экспорт

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры
	
#КонецОбласти

#Область Base64

Функция URL_Safe_Base64_Кодировать(СтрокаКодирования)
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(СтрокаКодирования));
КонецФункции

Функция URL_Safe_Base64_Декодировать(СтрокаДекодирования)
	Возврат ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(СтрокаДекодирования));
КонецФункции
	
#КонецОбласти