 
 #Область УсловныеОператоры
 
Функция ДатаЗаполнена(Знач ДатаЗначение) Экспорт

	Если ДатаЗначение = Дата(1, 1, 1) Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
 	
 #КонецОбласти
 
#Область УниверсальныеОбъекты

Функция СоответствиеВСтруктуру(СоответствиеЗнач) Экспорт
	
	Результат = Новый Структура;
	
	Если ТипЗнч(СоответствиеЗнач) = Тип("Соответствие") Тогда
		
		Фиксированная = Ложь;
		
	ИначеЕсли ТипЗнч(СоответствиеЗнач) = Тип("ФиксированноеСоответствие") Тогда
		
		Фиксированная = Истина;
		
	Иначе
		
		ВызватьИсключение "Неверный тип значения";
		
	КонецЕсли;
	
	Для Каждого Элемент Из СоответствиеЗнач Цикл
		
		Результат.Вставить(Элемент.Ключ, Элемент.Значение);	
		
	КонецЦикла;
	
	Если Фиксированная Тогда
		
		Возврат Новый ФиксированнаяСтруктура(Результат);
		
	Иначе
		
		Возврат Результат;
		
	КонецЕсли;
	
КонецФункции

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт

   Массив = Новый Массив();
   СтруктураСтрокой = "";
   НужнаЗапятая = Ложь;
   
   Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
	   
	   Если НужнаЗапятая Тогда
           СтруктураСтрокой = СтруктураСтрокой + ",";
	   КонецЕсли;
	   
       СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
       НужнаЗапятая = Истина;
	   
   КонецЦикла;
   
   Для Каждого Строка Из ТаблицаЗначений Цикл
	   
       НоваяСтрока = Новый Структура(СтруктураСтрокой);
       ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
       Массив.Добавить(НоваяСтрока);
	   
   КонецЦикла;
   
   Возврат Массив;

КонецФункции

#КонецОбласти

#Область JSON

Функция ОбъектВJSON(Структура) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;			
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Структура);			
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции
	
#КонецОбласти

#Область ДатаВремя

Функция МинутыВСекунды(Минуты) Экспорт
	
	Возврат Минуты * 60;	
	
КонецФункции   

Функция ЧасыВСекунды(Часы) Экспорт
	
	Возврат Часы * 3600;	
	
КонецФункции

Функция ДниВСекунды(Дни) Экспорт
	
	Возврат Дни * 86400;	
	
КонецФункции 

Функция НеделиВСекунды(Недели) Экспорт
	
	Возврат Недели * 604800;	
	
КонецФункции

Функция ДнейВМесяце(ДатаВремя) Экспорт
	
	Возврат День(КонецМесяца(ДатаВремя));	
	
КонецФункции

#КонецОбласти

#Область ГлобальныеКонстанты

Функция ДатаОкончанияВремен() Экспорт
	
	Возврат Дата(3999, 12, 31, 23, 59, 59);	
	
КонецФункции
	
#КонецОбласти

#Область Генераторы

Функция ГенерироватьСлучайнуюПоследовательностьБуквЦифр(Длина=8) Экспорт
	
	Результат = "";
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ВариантыСимволов = "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"; // 36 символов
	
	Для К = 1 По Длина Цикл
				
		РандЧ = ГСЧ.СлучайноеЧисло(1, 36);
		Результат = Результат + Сред(ВариантыСимволов, РандЧ, 1);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти