Функция ПолучитьКрайнийСрокОплаты(ВремяНаОплату = Неопределено, ДатаНачала = Неопределено)
		
	Если ДатаНачала = Неопределено Тогда
		
		ДатаНачала = ТекущаяДата();	
		
	КонецЕсли;
	
	Возврат ДатаНачала + Константы.КрайнийСрокОплатыПодпискиВДнях.ВСекундах();
	
КонецФункции

Процедура ЗавершениеПервойОплаты(Счет) Экспорт
	
	Документы.ВнесениеОплаты.СформироватьОплатуНаОснованииСчета(Счет);
	Счет.Подписка.Активировать();	
	РегистрыСведений.ПланВыставленияСчетовНаПродлениеПодписки.ЗапланироватьСледующуюОплату(Счет.Подписка);
	Документы.ПартнерскийКонтракт.СформироватьНаОснованииПодписки(Счет.Подписка);
	
КонецПроцедуры
