
Функция КоличествоСлотовЗанято(СерверСсылка, ИмяКонфигурации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоЗанято
		|ИЗ
		|	РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
		|ГДЕ
		|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
		|	И СлотыКонфигураций.ИмяКонфигурации = &ИмяКонфигурации
		|	И СлотыКонфигураций.Сервер = &СерверСсылка";
	
	Запрос.УстановитьПараметр("ИмяКонфигурации", ИмяКонфигурации);
	Запрос.УстановитьПараметр("СерверСсылка", СерверСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.КоличествоЗанято = Null Тогда
		Возврат 0;	
	КонецЕсли;
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЗанято;
	
КонецФункции