
Функция КоличествоСлотовЗанято(СерверСсылка, ИмяКонфигурации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоЗанято
		|ИЗ
		|	РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
		|ГДЕ
		|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
		|	И СлотыКонфигураций.ИмяКонфигурации = &ИмяКонфигурации
		|	И СлотыКонфигураций.Сервер = &СерверСсылка";
	
	Запрос.УстановитьПараметр("ИмяКонфигурации", ИмяКонфигурации);
	Запрос.УстановитьПараметр("СерверСсылка", СерверСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.КоличествоЗанято = Null Тогда
		Возврат 0;	
	КонецЕсли;
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЗанято;
	
КонецФункции

Процедура СохранитьСлот(
	СерверСсылка, ИмяКонфигурации, ИдСлота, Пользователь,
	НазваниеНаСервере, ФайлКонфигурации, Статус, НазваниеПользователя=Неопределено
) Экспорт
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Сервер = СерверСсылка;
	НоваяЗапись.ИмяКонфигурации = ИмяКонфигурации;
	НоваяЗапись.ИдСлота = ИдСлота;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.НазваниеПользователя = НазваниеПользователя;
	НоваяЗапись.НазваниеНаСервере = НазваниеНаСервере;
	НоваяЗапись.ФайлКонфигурации = ФайлКонфигурации;
	НоваяЗапись.Статус = Статус;
	
	НоваяЗапись.Записать();
	
КонецПроцедуры


Функция ДобавитьСлотыИзОтветаСервера(Данные, СерверСсылка, ИмяКонфигурации) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Сервер.Установить(СерверСсылка);
	//НаборЗаписей.От 
	
	Для Каждого Эл Из Данные.data Цикл
		
		ДанныеСлота = WGD_Соединение.ПолучитьДанныеСлотаКонфигурации(ИмяКонфигурации, СерверСсылка, Эл.id);
		
		НоваяЗапись = НаборЗаписей.Добавить();	
		НоваяЗапись.Сервер = СерверСсылка;
		НоваяЗапись.ИмяКонфигурации = ИмяКонфигурации;
		НоваяЗапись.ИдСлота = Эл.id;
		НоваяЗапись.НазваниеНаСервере = Эл.name;
		НоваяЗапись.ФайлКонфигурации = ДанныеСлота.data.file;
		НоваяЗапись.Статус = Перечисления.СтатусСлотаКонфигурации.Свободен;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецФункции
