
Функция КоличествоСлотовЗанято(СерверСсылка, ИмяКонфигурации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(1) КАК КоличествоЗанято
		|ИЗ
		|	РегистрСведений.СлотыКонфигураций КАК СлотыКонфигураций
		|ГДЕ
		|	СлотыКонфигураций.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусСлотаКонфигурации.Удален)
		|	И СлотыКонфигураций.ИмяКонфигурации = &ИмяКонфигурации
		|	И СлотыКонфигураций.Сервер = &СерверСсылка";
	
	Запрос.УстановитьПараметр("ИмяКонфигурации", ИмяКонфигурации);
	Запрос.УстановитьПараметр("СерверСсылка", СерверСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Если ВыборкаДетальныеЗаписи.КоличествоЗанято = Null Тогда
		Возврат 0;	
	КонецЕсли;
	
	Возврат ВыборкаДетальныеЗаписи.КоличествоЗанято;
	
КонецФункции

Функция ДобавитьСлотыИзОтветаСервера(ДанныеСлотов, ДанныеГенерации, СерверСсылка, ИмяКонфигурации) Экспорт
	
	ДанныеГенерации = ОбщегоНазначения.ПреобразованиеМассивВТаблицуЗначений(ДанныеГенерации);
	
	Для Каждого Стр Из ДанныеСлотов Цикл
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Сервер = СерверСсылка;
		Запись.ИмяКонфигурации = ИмяКонфигурации;
		НайденаСтрока = ДанныеГенерации.Найти(СтрЗаменить(Стр.fileName, "_" + ИмяКонфигурации, ""), "name");
		Запись.ИдСлота = НайденаСтрока.id;
		Запись.НазваниеНаСервере = Стр.fileName;
		Запись.ФайлКонфигурации = Стр.file;
		Запись.Записать();
		
	КонецЦикла;
	
КонецФункции
