Процедура ЗаписатьФайлВБазу(ОбъектЗаписи, ДанныеФайла, РасширениеФайла, РазмерФайла) Экспорт
	
	// TODO Работает вообще или нет?
	АлгоритмСжатия = Новый СжатиеДанных(9);
	
	ХранилищеСФайлом = Новый ХранилищеЗначения(ДанныеФайла, АлгоритмСжатия);
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.Объект = ОбъектЗаписи;
	НоваяЗапись.ДанныеФайла = ХранилищеСФайлом;
	НоваяЗапись.Расширение = РасширениеФайла;
    НоваяЗапись.РазмерФайла = РазмерФайла;
	НоваяЗапись.Записать();
	
КонецПроцедуры

Функция ПолучитьДанныеФайла(ОбъектЧтения) Экспорт
	
	ЧтениеФайла = СоздатьМенеджерЗаписи();
 	ЧтениеФайла.Объект = ОбъектЧтения;
	ЧтениеФайла.Прочитать();
	
	ДанныеФайла = ЧтениеФайла.ДанныеФайла.Получить();
	
	Возврат ДанныеФайла;
	
КонецФункции