Функция ПолучитьКрайнийСрокОплаты(ВремяНаОплату = Неопределено, ДатаНачала = Неопределено)
		
	Если ДатаНачала = Неопределено Тогда
		
		ДатаНачала = ТекущаяДата();	
		
	КонецЕсли;
	
	Возврат ДатаНачала + Константы.КрайнийСрокОплатыПодпискиВДнях.ВСекундах();
	
КонецФункции

Процедура ЗавершениеПервойОплаты(Счет) Экспорт
	
	НоваяОплатаПодписки = Документы.ВнесениеОплаты.СоздатьДокумент();
	НоваяОплатаПодписки.Дата = ТекущаяДата();
	НоваяОплатаПодписки.ДатаОплаты = ТекущаяДата();
	НоваяОплатаПодписки.Счет = Счет;
	НоваяОплатаПодписки.Контрагент = Счет.Контрагент;
	НоваяОплатаПодписки.СуммаДокумента = Счет.СуммаДокумента;
	НоваяОплатаПодписки.СпособОплаты = Счет.ОжидаемыйСпособОплаты;
	НоваяОплатаПодписки.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Счет.Оплата = НоваяОплатаПодписки.Ссылка;
	Счет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Подписка = Счет.Подписка.ПолучитьОбъект();
	Подписка.Статус = Перечисления.СтатусПодписки.Активна;
	Подписка.ДатаНачала = ТекущаяДата();
	Подписка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	РегистрыСведений.ПланВыставленияСчетовНаПродлениеПодписки.ЗапланироватьСледующуюОплату(Счет.Подписка);
	
	НовыйПерсональныйПромокод = Документы.ПерсональныйПромокод.СоздатьДокумент();
	НовыйПерсональныйПромокод.НачалоДействия = ТекущаяДата();
	НовыйПерсональныйПромокод.Промокод = ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр();
	НовыйПерсональныйПромокод.Реферал = Счет.Контрагент;
	НовыйПерсональныйПромокод.МатеринскийРеферал = Подписка.Реферал;
	//НовыйПерсональныйПромокод.ПартнерскаяКомпания = Значение;
	//НовыйПерсональныйПромокод.ПрайсЛист = Значение;
	//НовыйПерсональныйПромокод.ЗначениеВознаграждения = Значение;
	//НовыйПерсональныйПромокод.ТипВознаграждения = Значение;
	// TODO!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

КонецПроцедуры
