Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ПромокодыПериодДействия
	Движения.ПромокодыПериодДействия.Записывать = Истина;
	Для Каждого ТекСтрокаПартнеры Из Партнеры Цикл
		Движение = Движения.ПромокодыПериодДействия.Добавить();
		Движение.Промокод = ТекСтрокаПартнеры.Промокод;
		Движение.Реферал = ТекСтрокаПартнеры.Партнер;
		Движение.ПрайсЛист = ПрайсЛист;
		Движение.НачалоДействия = ТекСтрокаПартнеры.НачалоУчастия;
		Если ЗначениеЗаполнено(ТекСтрокаПартнеры.КонецУчастия) Тогда
			Движение.КонецДействия = ТекСтрокаПартнеры.КонецУчастия;
		Иначе
			Движение.КонецДействия = ГлобальныеКонстанты.ДатаОкончанияВремен();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
