
Процедура СформироватьНаОснованииПодписки(Подписка)
	
	НовыйПартнерскийКонтракт = Документы.ПартнерскийКонтракт.СоздатьДокумент();
	
	НовыйПартнерскийКонтракт.ДатаНачала = ТекущаяДата();
	НовыйПартнерскийКонтракт.Партнер = Подписка.Контрагент;
	НовыйПартнерскийКонтракт.ГоловнойПартнер = Подписка.Реферал;
	НовыйПартнерскийКонтракт.Компания = Подписка.ИсточникПодписки;
	НовыйПартнерскийКонтракт.Промокод = ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр();
	
	НовыйСтимул = НовыйПартнерскийКонтракт.Стимулы.Добавить();
	НовыйСтимул.ВидСтимула = Перечисления.ВидСтимулаЗаРеферал.ПроцентСкидкиОдинМесяц;
	НовыйСтимул.ЗначениеСтимула = 30;
	
	НовыйПартнерскийКонтракт.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
КонецПроцедуры
