
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КонтрактыПартнерскихКомпаний
	Движения.КонтрактыПартнерскихКомпаний.Записывать = Истина;
	Движение = Движения.КонтрактыПартнерскихКомпаний.Добавить();
	Движение.Компания = Компания;
	Движение.Контракт = Ссылка;
	Движение.ДатаНачала = ДатаНачала;
	Движение.ДатаОкончания = ДатаОкончания;

	// регистр ПромокодыПериодДействия
	Движения.ПромокодыПериодДействия.Записывать = Истина;
	Движение = Движения.ПромокодыПериодДействия.Добавить();
	Движение.Промокод = Промокод;
	Движение.ПрайсЛист = Компания.ПрайсЛист;
	Движение.ДатаНачала = ДатаНачала;
	Движение.ДатаОкончания = ДатаОкончания;

	// регистр СтимулыПартнеров
	Движения.СтимулыПартнеров.Записывать = Истина;
	Для Каждого ТекСтрокаСтимулы Из Стимулы Цикл
		Движение = Движения.СтимулыПартнеров.Добавить();
		Движение.Партнер = Партнер;
		Движение.Контракт = Ссылка;
		Движение.ВидСтимула = ТекСтрокаСтимулы.ВидСтимула;
		Движение.ЗначениеСтимула = ТекСтрокаСтимулы.ЗначениеСтимула;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
