
Процедура СформироватьОплатуНаОснованииСчета(Счет) Экспорт
	
	НовыйДокумент = СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДата();
	НовыйДокумент.ДатаОплаты = ТекущаяДата();
	НовыйДокумент.Счет = Счет;
	НовыйДокумент.Контрагент = Счет.Контрагент;
	НовыйДокумент.СуммаДокумента = Счет.СуммаДокумента;
	НовыйДокумент.СпособОплаты = Счет.ОжидаемыйСпособОплаты;
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
	Счет.Оплата = НовыйДокумент.Ссылка;
	Счет.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Оперативный);
	
КонецПроцедуры
