
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПодписки") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Подписка = ДанныеЗаполнения.Подписка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПодпискаДокумент = Счет.Подписка;
	Если ЗначениеЗаполнено(ПодпискаДокумент.Реферал) И  ЗначениеЗаполнено(ПодпискаДокумент.ИсточникПодписки) Тогда
		
		//Стимулы = РегистрыСведений.СтимулыПартнеров.ПолучитьСтимулы(ПодпискаДокумент.Реферал, ПодпискаДокумент.ИсточникПодписки);
		
		СтимулЕжемесячногоВознаграждения = ПодпискаДокумент.ИсточникПодписки.Стимулы.Найти(Перечисления.ВидСтимулаЗаРеферал.ПроцентОтБазовойСтоимостиЕжемесячный, "ВидСтимула");
		
		Если СтимулЕжемесячногоВознаграждения <> Неопределено Тогда
			
			Движения.БалансВыплатКонтрагентам.Записывать = Истина;
			Движение = Движения.БалансВыплатКонтрагентам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = ПодпискаДокумент.Реферал;
			Движение.Сумма = Счет.БазоваяСтоимость / 100 * СтимулЕжемесячногоВознаграждения.ЗначениеСтимула;
			Движение.ПричинаВыплаты = Перечисления.ВидСтимулаЗаРеферал.ПроцентОтБазовойСтоимостиЕжемесячный;
			
		КонецЕсли;
		
		// TODO перенести в активацию подписки
		//СтимулСкидкиНаОдинМесяц = ПодпискаДокумент.ИсточникПодписки.Стимулы.Найти(Перечисления.ВидСтимулаЗаРеферал.ПроцентСкидкиОдинМесяц, "ВидСтимула");
		//
		//Если СтимулСкидкиНаОдинМесяц <> Неопределено Тогда
		//	
		//	Документы.Подписка.НайтиАктивную(ПодпискаДокумент.Реферал);
		//	
		//КонецЕсли;	

		Если ЗначениеЗаполнено(ПодпискаДокумент.ИсточникПодписки.ГоловнойКонтракт) Тогда
			
			
			ГоловнойКонтракт = ПодпискаДокумент.ИсточникПодписки.ГоловнойКонтракт;
			
			СтимулЗаПривлечение =
				ГоловнойКонтракт.Стимулы.Найти(Перечисления.ВидСтимулаЗаРеферал.ПроцентОтПривлечения, "ВидСтимула");
				
			Если СтимулЗаПривлечение <> Неопределено Тогда
				
				Движения.БалансВыплатКонтрагентам.Записывать = Истина;
				Движение = Движения.БалансВыплатКонтрагентам.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Контрагент = ПодпискаДокумент.Реферал;
				Движение.Сумма = Счет.БазоваяСтоимость / 100 * СтимулЗаПривлечение.ЗначениеСтимула;
				Движение.ПричинаВыплаты = Перечисления.ВидСтимулаЗаРеферал.ПроцентОтПривлечения;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;
	
	Движения.БалансСчетовПользователей.Записывать = Истина;
	Движение = Движения.БалансСчетовПользователей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = СуммаДокумента;
	
КонецПроцедуры

