
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПодписки") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Подписка = ДанныеЗаполнения.Подписка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр БалансВыплатКонтрагентам Приход
	
	ПодпискаДокумент = Счет.Подписка;
	Если ЗначениеЗаполнено(ПодпискаДокумент.Реферал) Тогда
		
		Если ТипЗнч(ПодпискаДокумент.ИсточникПодписки) = Тип("ДокументСсылка.ПартнерскаяКомпания") Тогда
						
			СтавкаПроцент = РегистрыСведений.СтавкиПартнеров.ПолучитьСтавку(ПодпискаДокумент.Реферал, ПодпискаДокумент.ИсточникПодписки);
			
			Движения.БалансВыплатКонтрагентам.Записывать = Истина;
			Движение = Движения.БалансВыплатКонтрагентам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = ПодпискаДокумент.Реферал;
			Движение.Сумма = СуммаДокумента / 100 * СтавкаПроцент;

		КонецЕсли;
		
	КонецЕсли;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
