
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетНаОплатуПодписки") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Подписка = ДанныеЗаполнения.Подписка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПодпискаДокумент = Счет.Подписка;
	Если ЗначениеЗаполнено(ПодпискаДокумент.Реферал) Тогда
		
		Если ТипЗнч(ПодпискаДокумент.ИсточникПодписки) = Тип("ДокументСсылка.ПартнерскаяКомпания") Тогда // TODO ПЕРЕДЕЛАТЬ В СООТВЕТСВИИ С ПРАВКАМИ			
			
			СтавкаПроцент = РегистрыСведений.СтимулыПартнеров.ПолучитьЗначениеСтимула(ПодпискаДокумент.Реферал, ПодпискаДокумент.ИсточникПодписки);
			
			Движения.БалансВыплатКонтрагентам.Записывать = Истина;
			Движение = Движения.БалансВыплатКонтрагентам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = ПодпискаДокумент.Реферал;
			Движение.Сумма = Счет.БазоваяСтоимость / 100 * СтавкаПроцент;

		КонецЕсли;
		
		
		
	КонецЕсли;
	
	Движения.БалансСчетовПользователей.Записывать = Истина;
	Движение = Движения.БалансСчетовПользователей.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Сумма = СуммаДокумента;
	
КонецПроцедуры
