
#Область ОбщиеПроцедурыИФункции

Функция ПолучитьПараметрыОтвета(Ответ) Экспорт
	
	Попытка
		
		Возврат ОбщегоНазначения.JSONВСтруктуру(Ответ.ПолучитьТелоКакСтроку());
	
	Исключение
		
		ВызватьИсключение СтрШаблон("Неверные параметры запроса (%1)", ОписаниеОшибки());
		
	КонецПопытки;
	
КонецФункции

Функция СформироватьОтвет(ПараметрыОтвета, КодОтвета=200) Экспорт
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.УстановитьТелоИзСтроки(ОбщегоНазначения.ОбъектВJSON(ПараметрыОтвета));
	Возврат Ответ;
	
КонецФункции

Функция ЗапросHTTP(URL, Порт, URL_Запроса, Метод, Заголовки, TLS=Ложь) Экспорт
	
	ЗащищенноеСоединение = Неопределено;
	Если TLS Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(
            Новый СертификатКлиентаОС,
            Новый СертификатыУдостоверяющихЦентровОС,
            РежимПроверкиОтзываTLSСертификатаСервера.Строгий
		);	
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(
        URL, Порт,,,,,
		ЗащищенноеСоединение
    );

    Запрос = Новый HTTPЗапрос(URL_Запроса, Заголовки);
	Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
	Возврат ПолучитьПараметрыОтвета(Ответ);
	
КонецФункции

#КонецОбласти
