
Функция ПолучитьСтавку(Партнер, Компания) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтавкиПартнеров.Ставка КАК Ставка
		|ИЗ
		|	РегистрСведений.СтавкиПартнеров КАК СтавкиПартнеров
		|ГДЕ
		|	СтавкиПартнеров.Партнер = &Партнер
		|	И СтавкиПартнеров.Компания = &Компания";
	
	Запрос.УстановитьПараметр("Компания", Компания);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.Ставка;
	
КонецФункции