
Функция ПолучитьСтимулы(Партнер, Контракт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтимулыПартнеров.ВидСтимула КАК ВидСтимула,
		|	СтимулыПартнеров.ЗначениеСтимула КАК ЗначениеСтимула
		|ИЗ
		|	РегистрСведений.СтимулыПартнеров КАК СтимулыПартнеров
		|ГДЕ
		|	СтимулыПартнеров.Партнер = &Партнер
		|	И СтимулыПартнеров.Контракт = &Контракт";
	
	Запрос.УстановитьПараметр("Контракт", Контракт);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции