
Функция ПолучитьЗначениеСтимула(Партнер, Компания, ВидСтимула) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтимулыПартнеров.ЗначениеСтимула КАК ЗначениеСтимула
		|ИЗ
		|	РегистрСведений.СтимулыПартнеров КАК СтимулыПартнеров
		|ГДЕ
		|	СтимулыПартнеров.Партнер = &Партнер
		|	И СтимулыПартнеров.Компания = &Компания
		|	И СтимулыПартнеров.ВидСтимула = &ВидСтимула";
	
	Запрос.УстановитьПараметр("ВидСтимула", ВидСтимула);
	Запрос.УстановитьПараметр("Компания", Компания);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ЗначениеСтимула;
	
КонецФункции