	#Область Сервисы

Функция echoGET(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос);
	Возврат HTTP_Соединение.СформироватьОтвет(ПараметрыЗапроса);
	
КонецФункции

Функция promocode_infoGET(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос);
	
	ДатаПодписки = ТекущаяДата();	
	ПланПодписки = Справочники.ПланПодписки.Базовый;	
	ПромокодСтрока = ПараметрыЗапроса.promo_code;
	
	ДанныеПромокода = Промокоды.ПолучитьДанныеПоПромокоду(ПромокодСтрока, ПланПодписки, ДатаПодписки);
	
	Если ДанныеПромокода <> Неопределено Тогда
		
		ПараметрыОтвета = КсенонОтвет.ПрайсЛистПоПромокоду(ДанныеПромокода, ПромокодСтрока);
		Возврат HTTP_Соединение.СформироватьОтвет(ПараметрыОтвета);
		
	Иначе
		
		Возврат HTTP_Соединение.СформироватьОтвет(Неопределено, 204);
		
	КонецЕсли;

КонецФункции

Функция pricelistGET(Запрос)
		
	ДатаСреза = ТекущаяДата();	
	ПланПодписки = Справочники.ПланПодписки.Базовый;	
	
	ПрайсЛист = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза, ПланПодписки);
	
    Если ПрайсЛист <> Неопределено Тогда
		
		ПараметрыОтвета = КсенонОтвет.ПрайсЛист(ПрайсЛист);
		Возврат HTTP_Соединение.СформироватьОтвет(ПараметрыОтвета);
		
	Иначе	
		
		ВызватьИсключение "Основной прайс лист не установлен!";
		
	КонецЕсли;
	
КонецФункции

Функция invoicePOST(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос);
	Ответ = КсенонОтвет.СчетНаОплату(ПараметрыЗапроса.telegram_id, ПараметрыЗапроса.selected_item, ПараметрыЗапроса.payment_method_id);
	Возврат HTTP_Соединение.СформироватьОтвет(Ответ.Параметры, ?(Ответ.Создано, 201, 200));
	
КонецФункции

Функция invoiceGET(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос); 
	ПараметрыОтвета = КсенонОтвет.ИнформацияОСчетеНаОплату(ПараметрыЗапроса.invoice);
	Возврат HTTP_Соединение.СформироватьОтвет(ПараметрыОтвета);
	
КонецФункции

Функция userPOST(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос);
	Ответ = СессииТелеграм.ПолучитьКонтрагентаСессииИлиСоздать(
		ПараметрыЗапроса.telegram_id, Перечисления.Бот.ПользовательскийБазовый, ПараметрыЗапроса.full_name);
	Возврат HTTP_Соединение.СформироватьОтвет(КсенонОтвет.ОбернутьОбъект(Ответ.Контрагент), ?(Ответ.Создано, 201, 200));
	
КонецФункции

Функция paymentPOST(Запрос)
	
	ПараметрыЗапроса = HTTP_Соединение.ПолучитьПараметрыОтвета(Запрос);
	ПараметрыОтвета = КсенонОтвет.Оплата(ПараметрыЗапроса.invoice);
	Возврат HTTP_Соединение.СформироватьОтвет(ПараметрыОтвета); 
	
КонецФункции

#КонецОбласти