// HTTPСервисЗапрос

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыЗапроса(Запрос) Экспорт
	
	Попытка
		
		Если Запрос.ПараметрыЗапроса.Количество() = 0 Тогда
			
			Возврат Новый Структура;
			
		ИначеЕсли Запрос.ПараметрыЗапроса.Количество() <> 1 Тогда
			
			ВызватьИсключение "";	
			
		КонецЕсли;
		
		Для Каждого Параметр Из Запрос.ПараметрыЗапроса Цикл
			
			Возврат ОбщегоНазначения.JSONВСтруктуру(Параметр.Ключ);
			
		КонецЦикла;	
	
	Исключение
		
		ВызватьИсключение "Неверные параметры запроса";
		
	КонецПопытки;
	
КонецФункции

Функция СформироватьОтвет(ПараметрыОтвета, КодОтвета=200)
	
	Ответ = Новый HTTPСервисОтвет(КодОтвета);
	Ответ.УстановитьТелоИзСтроки(ОбщегоНазначения.ОбъектВJSON(ПараметрыОтвета));
	Возврат Ответ;
	
КонецФункции


#КонецОбласти
	
#Область Сервисы

Функция echoGET(Запрос)
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Запрос);
	Возврат СформироватьОтвет(ПараметрыЗапроса);
	
КонецФункции

Функция promocode_infoGET(Запрос)
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Запрос);
	
	ДатаПодписки = ТекущаяДата();	
	ПланПодписки = Перечисления.ПланПодписки.Базовый;	
	ПромокодСтрока = ПараметрыЗапроса.promo_code;
	
	ДанныеПромокода = ПромокодыНаСервере.ПолучитьДанныеПоПромокоду(ПромокодСтрока, ПланПодписки, ДатаПодписки);
	
	Если ДанныеПромокода <> Неопределено Тогда
		
		ПараметрыОтвета = КсенонОтвет.ПрайсЛистПоПромокоду(ДанныеПромокода, ПромокодСтрока);
		Возврат СформироватьОтвет(ПараметрыОтвета);
		
	Иначе
		
		Возврат СформироватьОтвет(Неопределено, 204);
		
	КонецЕсли;

КонецФункции

Функция pricelistGET(Запрос)
		
	ДатаСреза = ТекущаяДата();	
	ПланПодписки = Перечисления.ПланПодписки.Базовый;	
	
	ПрайсЛист = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(ДатаСреза, ПланПодписки);
	
    Если ПрайсЛист <> Неопределено Тогда
		
		ПараметрыОтвета = КсенонОтвет.ПрайсЛист(ПрайсЛист);
		Возврат СформироватьОтвет(ПараметрыОтвета);
		
	Иначе	
		
		ВызватьИсключение "Основной прайс лист не установлен!";
		
	КонецЕсли;
	
КонецФункции

Функция sessionPUT(Запрос)
	
	ПараметрыЗапроса = ПолучитьПараметрыЗапроса(Запрос);
	
	
КонецФункции

#КонецОбласти