
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Подписка") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Клиент;
		Подписка = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СтавкаТарифа;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
