
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Инструменты.ДатаЗаполнена(Объект.ДатаУтверждения) Тогда
		
		Объект.ДатаУтверждения = ТекущаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыСтоимостьПриИзменении(Элемент)
	ОбновитьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТарифыСкидкаПриИзменении(Элемент)
	ОбновитьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСумму(Элемент)
	
	СтрокаТариф = Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока];
	СтрокаТариф.Сумма = СтрокаТариф.Стоимость - СтрокаТариф.Стоимость * (СтрокаТариф.Скидка / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыТарифПриИзменении(Элемент)
	
	НайденыеСтроки = Объект.Тарифы.НайтиСтроки(Новый Структура("Тариф", Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока].Тариф));

	Если НайденыеСтроки.Количество() <> 1 Тогда
		
		Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока].Тариф = Неопределено;
		Сообщить("Такой тариф уже есть в списке!");
		
	КонецЕсли;
КонецПроцедуры
