&НаКлиенте
Процедура ГенерироватьПромокоды(Команда)
	ГенерироватьПромокодыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КопироватьКакСсылки(Команда)
	
	Если ЭтотОбъект.Модифицированность ИЛИ НЕ Объект.Проведен Тогда
		
		ПредупреждениеАсинх("Необходимо провести перед копированием");
		Возврат;
		
	КонецЕсли;
	
	Текст = ПолучитьТекстДляКопированияНаСервере();
	ОбщегоНазначения_Клиент.СкопироватьВБуфер(Текст);
	
КонецПроцедуры

Функция ПолучитьТекстДляКопированияНаСервере()
	
	Текст = "";
	Счетчик = 1;
	
	Для Каждого Стр Из Объект.Промокоды Цикл
		
		Текст = Текст + "#" + Счетчик + Символы.ПС + "t.me/" +
			Константы.ТегТелеграмБота.Получить() + "?start=" +
			Стр.Промокод + Символы.ПС + "____________________" + Символы.ПС;
			
		Счетчик = Счетчик + 1;
			
	КонецЦикла;
		
	Возврат Текст;
	
КонецФункции

Процедура ГенерироватьПромокодыНаСервере()
	
	Для Кол = 1 По КоличествоПромокодов Цикл
		НовыйСтр = Объект.Промокоды.Добавить();
		НовыйСтр.Промокод = ОбщегоНазначения.ГенерироватьСлучайнуюПоследовательностьБуквЦифр(16, Истина);
		НовыйСтр.ДействуетОт = ТекущаяДата();
		НовыйСтр.ДействуетДо = ?(НЕ ОбщегоНазначения.ДатаЗаполнена(ДействуютДо),
			ОбщегоНазначения.ДатаОкончанияВремен(), ДействуютДо
		);
	КонецЦикла;
		
КонецПроцедуры