
Функция ПолучитьКонтрагентаСессииИлиСоздать(ТелеграмИД, Бот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекущиеСессииТелеграм.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	РегистрСведений.ТекущиеСессииТелеграм КАК ТекущиеСессииТелеграм
		|ГДЕ
		|	ТекущиеСессииТелеграм.ТелеграмИД = &ТелеграмИД
		|	И ТекущиеСессииТелеграм.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ТелеграмИД", ТелеграмИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СейчасДата = ТекущаяДата();
	
		НовыйКонтрагент = Справочники.Контрагент.СоздатьЭлемент();
		НовыйКонтрагент.Родитель = ПредопределенноеЗначение("Справочник.Контрагент.Клиенты");
		НовыйКонтрагент.Наименование = СтрШаблон("Клиент %1", ТелеграмИД);
		НовыйКонтрагент.Записать();
		
		НоваяСессия = РегистрыСведений.ТекущиеСессииТелеграм.СоздатьМенеджерЗаписи();
		НоваяСессия.ТелеграмИД = ТелеграмИД;
		НоваяСессия.Бот = Бот;
		НоваяСессия.НачалоСессии = СейчасДата;
		НоваяСессия.ПоследнееИспользование = СейчасДата;
		
		Возврат НовыйКонтрагент;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КонтрагентСсылка;
	
КонецФункции

