
Функция ПолучитьКонтрагентаСессии(ТелеграмИД, Бот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТекущиеСессииТелеграм.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	РегистрСведений.ТекущиеСессииТелеграм КАК ТекущиеСессииТелеграм
		|ГДЕ
		|	ТекущиеСессииТелеграм.ТелеграмИД = &ТелеграмИД
		|	И ТекущиеСессииТелеграм.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ТелеграмИД", ТелеграмИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КонтрагентСсылка;
	
КонецФункции

