Функция ПолучитьДанныеПоПромокоду(Промокод, ПланПодписки, ДатаПодписки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПромокодыПериодДействия.ПрайсЛист КАК ПрайсЛист,
		|	ПромокодыПериодДействия.Реферал КАК Реферал,
		|	ПромокодыПериодДействия.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ПромокодыПериодДействия КАК ПромокодыПериодДействия
		|ГДЕ
		|	ПромокодыПериодДействия.Промокод = &Промокод
		|	И &Дата МЕЖДУ ПромокодыПериодДействия.ДатаНачала И ПромокодыПериодДействия.ДатаОкончания
		|	И ПромокодыПериодДействия.ПрайсЛист.План = &План";
	
	Запрос.УстановитьПараметр("Дата", ДатаПодписки);
	Запрос.УстановитьПараметр("Промокод", Промокод);
	Запрос.УстановитьПараметр("План", ПланПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
    	Возврат Неопределено;
	ИначеЕсли ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат Новый Структура("ПрайсЛист, Реферал, ИсточникПодписки", ВыборкаДетальныеЗаписи.ПрайсЛист, ВыборкаДетальныеЗаписи.Реферал, ВыборкаДетальныеЗаписи.Регистратор);
	Иначе
		ВызватьИсключение "Промокод не уникален!";	
	КонецЕсли;	
	
КонецФункции
