
Функция ПолучитьТелеграмИД(КонтрагентСсылка, Бот) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СессииТелеграм.ТелеграмИД КАК ТелеграмИД
		|ИЗ
		|	РегистрСведений.СессииТелеграм КАК СессииТелеграм
		|ГДЕ
		|	СессииТелеграм.Бот = &Бот
		|	И СессииТелеграм.Контрагент = &КонтрагентСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	СессииТелеграм.НачалоСессии";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ТелеграмИД;
		
КонецФункции