
Функция НеоплаченыеСчета(Контрагент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПодписки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СчетНаОплатуПодписки КАК СчетНаОплатуПодписки
		|ГДЕ
		|	СчетНаОплатуПодписки.Контрагент = &Контрагент
		|	И СчетНаОплатуПодписки.Проведен = ИСТИНА
		|	И СчетНаОплатуПодписки.ПометкаУдаления = ЛОЖЬ
		|	И СчетНаОплатуПодписки.КрайнийСрокОплаты > &ТекущаяДата
		|	И СчетНаОплатуПодписки.Оплата = ЗНАЧЕНИЕ(Документ.ОплатаПодписки.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НеоплаченныеСчета = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
    	НеоплаченныеСчета.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат НеоплаченныеСчета;
	
КонецФункции