&НаКлиенте
Процедура ТарифыСтоимостьПриИзменении(Элемент)
	ОбновитьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТарифыСкидкаПриИзменении(Элемент)
	ОбновитьСумму(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПланПриИзменении(Элемент)
	ПланПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		 ЭтаФорма.Элементы.ФормаУстановитьКакОсновной.Доступность = Истина;
		 ПланПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 
	 Если Объект.Тарифы.Количество() = 0 Тогда
	    ПоказатьПредупреждение(,"Не внесено ни одного тарифа");
		Отказ = Истина;
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЭтаФорма.Элементы.ФормаУстановитьКакОсновной.Доступность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСумму(Элемент)
	
	СтрокаТариф = Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока];
	СтрокаТариф.Сумма = СтрокаТариф.Стоимость - СтрокаТариф.Стоимость * (СтрокаТариф.Скидка / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ТарифыТарифПриИзменении(Элемент)
	
	НайденыеСтроки = Объект.Тарифы.НайтиСтроки(Новый Структура("Тариф", Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока].Тариф));

	Если НайденыеСтроки.Количество() <> 1 Тогда
		
		Объект.Тарифы[Элемент.Родитель.ТекущаяСтрока].Тариф = Неопределено;
		Сообщить("Такой тариф уже есть в списке!");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКакОсновной(Команда)
	
	Если ЭтотОбъект.Модифицированность Тогда
	    ПоказатьПредупреждение(,"Документ был изменен, чтобы установить основным, необходимо записать");
	Иначе
		УстановитьКакОсновнойНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьКакОсновнойНаСервере()

	МенеджерЗаписи = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.План = Объект.План;
	МенеджерЗаписи.ПрайсЛист = Объект.Ссылка;
	
	МенеджерЗаписи.Записать();
	
	ПланПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПланПриИзмененииНаСервере()
	
	ОсновнойПрайс = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.План) Тогда
		
		ОсновнойПрайс = РегистрыСведений.ИсторияИзмененийОсновныхПрайсЛистов.ПолучитьОсновнойПрайсЛистНаДату(ТекущаяДата(), Объект.План);
		
				
		Если ОсновнойПрайс = Объект.Ссылка Тогда
			
			ЭтаФорма.Элементы.ФормаУстановитьКакОсновной.Доступность = Ложь;
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Заголовок = "Этот прайс-лист установлен основным";
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Гиперссылка = Ложь;
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Видимость = Истина;
		
		ИначеЕсли ОсновнойПрайс <> Неопределено Тогда
			
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Заголовок = "(" + Строка(ОсновнойПрайс.Код) + ") " + Строка(ОсновнойПрайс);
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Гиперссылка = Истина;
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Видимость = Истина;
			
		Иначе
			
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Заголовок = "Основной прайс-лист не установлен";
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Гиперссылка = Ложь;
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Видимость = Истина;
			
		КонецЕсли;

		
	Иначе
		
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Заголовок = "";
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Гиперссылка = Ложь;
			ЭтаФорма.Элементы.ИнформацияОбОсновномПрайсЛисте.Видимость = Ложь;
		
	КонецЕсли;
		

КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОбОсновномПрайсЛистеНажатие(Элемент)
	
	Если ЗначениеЗаполнено(ОсновнойПрайс) Тогда		
		
		ОткрытьФорму("Справочник.ПрайсЛист.Форма.ФормаЭлемента", Новый Структура("Ключ", ОсновнойПрайс));
		
	КонецЕсли;
	
КонецПроцедуры

