
Процедура ДобавитьНовуюКонфигурацию(СерверСсылка, ИмяНовойКонфигурации, ЛимитСлотовНовойКонфигурации) Экспорт
	
	НоваяЗапись = СоздатьМенеджерЗаписи();
	НоваяЗапись.Сервер = СерверСсылка;
	НоваяЗапись.ИмяКонфигурации = ИмяНовойКонфигурации;
	НоваяЗапись.МаксимумСлотов = ЛимитСлотовНовойКонфигурации;
	НоваяЗапись.Записать();
	
КонецПроцедуры


Функция ВсеКонфигурацииСервера(СерверСсылка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонфигурацииСервера.ИмяКонфигурации КАК ИмяКонфигурации,
		|	КонфигурацииСервера.МаксимумСлотов КАК МаксимумСлотов
		|ИЗ
		|	РегистрСведений.КонфигурацииСервера КАК КонфигурацииСервера
		|ГДЕ
		|	КонфигурацииСервера.Сервер = &СерверСсылка";
	
	Запрос.УстановитьПараметр("СерверСсылка", СерверСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();

КонецФункции
