
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеПодписчиков Приход
	Движения.ДвижениеПодписчиков.Записывать = Истина;
	Движение = Движения.ДвижениеПодписчиков.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Количество = 1;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РегистрыСведений.ИсторияИзмененияСтатусаПодписки.ОбновитьДанные(Ссылка, Статус);
	РегистрыСведений.ИсторияИзмененияТарифаПодписки.ОбновитьДанные(Ссылка, Тариф, БазоваяСтоимость, СуммаРегулярногоПлатежа);
	
КонецПроцедуры

Функция ДатаСледующейОплаты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланВыставленияСчетовНаПродлениеПодписки.ДатаНаФормированиеСчета КАК ДатаНаФормированиеСчета
		|ИЗ
		|	РегистрСведений.ПланВыставленияСчетовНаПродлениеПодписки КАК ПланВыставленияСчетовНаПродлениеПодписки
		|ГДЕ
		|	ПланВыставленияСчетовНаПродлениеПодписки.Подписка = &Подписка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНаФормированиеСчета УБЫВ";
	
	Запрос.УстановитьПараметр("Подписка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Возврат ВыборкаДетальныеЗаписи.ДатаНаФормированиеСчета;
	
КонецФункции